In [36]:
import pandas as pd

In [38]:
import numpy as np

In [39]:
#pandas series

In [41]:
labels=['a','b','c']
my_list=[10,20,30]
arr=np.array([10,20,30])
d={'a':10,'b':20,'c':30}

In [43]:
pd.Series(my_list)

0    10
1    20
2    30
dtype: int64

In [46]:
pd.Series(my_list,index=labels)

a    10
b    20
c    30
dtype: int64

In [48]:
pd.Series(arr,)

0    10
1    20
2    30
dtype: int32

In [50]:
pd.Series(d)

a    10
b    20
c    30
dtype: int64

In [51]:
#DATA FRAMES =when u combine multiple seires together

In [53]:
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'Diana'],
    'Age': [20, 22, 21, 23],
    'City': ['New York', 'Los Angeles', 'Chicago', 'Houston'],
    'Salary': [3000, 3500, 3200, 4000]
}

In [75]:
df=pd.DataFrame(data)

In [77]:
df

      Name  Age         City  Salary
0    Alice   20     New York    3000
1      Bob   22  Los Angeles    3500
2  Charlie   21      Chicago    3200
3    Diana   23      Houston    4000

In [310]:
students = [
    {'Name': 'Alice', 'Age': 20, 'City': 'New York', 'Salary': 3000},
    {'Name': 'Bob', 'Age': 22, 'City': 'Los Angeles', 'Salary': 3500},
    {'Name': 'Charlie', 'Age': 21, 'City': 'Chicago', 'Salary': 3200},
    {'Name': 'Diana', 'Age': 23, 'City': 'Houston', 'Salary': 4000}
]
df2=pd.DataFrame(students)
columns=["Name"	,"Age",	"City",	"Salary"]
df2=pd.DataFrame(columns=columns)
df2

Empty DataFrame
Columns: [Name, Age, City, Salary]
Index: []

In [81]:
df2

      Name  Age         City  Salary
0    Alice   20     New York    3000
1      Bob   22  Los Angeles    3500
2  Charlie   21      Chicago    3200
3    Diana   23      Houston    4000

In [83]:
data_list = [
    {'Name': 'Alice', 'Age': 20, 'City': 'New York', 'Salary': 3000},
    {'Name': 'Bob', 'Age': 22, 'City': 'Los Angeles', 'Salary': 3500},
    {'Name': 'Charlie', 'Age': 21, 'City': 'Chicago', 'Salary': 3200},
    {'Name': 'Diana', 'Age': 23, 'City': 'Houston', 'Salary': 4000}
]

In [85]:
#Selection  and Indexing of Columns

In [87]:
df2

      Name  Age         City  Salary
0    Alice   20     New York    3000
1      Bob   22  Los Angeles    3500
2  Charlie   21      Chicago    3200
3    Diana   23      Houston    4000

In [89]:
# df2["Name"]
df2["City"]

0       New York
1    Los Angeles
2        Chicago
3        Houston
Name: City, dtype: object

In [91]:
df2[["Name","City"]]

      Name         City
0    Alice     New York
1      Bob  Los Angeles
2  Charlie      Chicago
3    Diana      Houston

In [93]:
# creating a new column

In [95]:
df2["Designation"]=["Doctor","Engineer","Pilot","Teacher"]

In [97]:
df2

      Name  Age         City  Salary Designation
0    Alice   20     New York    3000      Doctor
1      Bob   22  Los Angeles    3500    Engineer
2  Charlie   21      Chicago    3200       Pilot
3    Diana   23      Houston    4000     Teacher

In [98]:
#Removing Colimns

In [101]:
df2.drop('Designation',axis=1) #it not remove the from the dataset

      Name  Age         City  Salary
0    Alice   20     New York    3000
1      Bob   22  Los Angeles    3500
2  Charlie   21      Chicago    3200
3    Diana   23      Houston    4000

In [103]:
df2.drop('Designation',axis=1,inplace=True) #remove form dataset

In [105]:
df2

      Name  Age         City  Salary
0    Alice   20     New York    3000
1      Bob   22  Los Angeles    3500
2  Charlie   21      Chicago    3200
3    Diana   23      Houston    4000

In [107]:
#remove multiples cols
df2.drop(['City','Salary'],axis=1)

      Name  Age
0    Alice   20
1      Bob   22
2  Charlie   21
3    Diana   23

In [109]:
df2

      Name  Age         City  Salary
0    Alice   20     New York    3000
1      Bob   22  Los Angeles    3500
2  Charlie   21      Chicago    3200
3    Diana   23      Houston    4000

In [111]:
#Selecting rows

In [113]:
df2.loc[0] #locatios for rwos

Name         Alice
Age             20
City      New York
Salary        3000
Name: 0, dtype: object

In [115]:
df2.loc[[0,1]]

    Name  Age         City  Salary
0  Alice   20     New York    3000
1    Bob   22  Los Angeles    3500

In [117]:
df.iloc[3]

Name        Diana
Age            23
City      Houston
Salary       4000
Name: 3, dtype: object

In [119]:
#Selecting subsets of Rows and Columns

In [121]:
df2.iloc[0:2, 2:4]   #âœ… Use .iloc[] for index-based selection and .loc[] for label-based selection

          City  Salary
0     New York    3000
1  Los Angeles    3500

In [123]:
df.loc[[0,1]][["City","Salary"]]

          City  Salary
0     New York    3000
1  Los Angeles    3500

In [124]:
df2.loc[[2,3]][["Name","Age"]]

      Name  Age
2  Charlie   21
3    Diana   23

In [127]:
#DeleteRows
df2.drop(0,axis=0)

      Name  Age         City  Salary
1      Bob   22  Los Angeles    3500
2  Charlie   21      Chicago    3200
3    Diana   23      Houston    4000

In [128]:
df2

      Name  Age         City  Salary
0    Alice   20     New York    3000
1      Bob   22  Los Angeles    3500
2  Charlie   21      Chicago    3200
3    Diana   23      Houston    4000

In [129]:
#Conditional Statement

In [133]:
df2

      Name  Age         City  Salary
0    Alice   20     New York    3000
1      Bob   22  Los Angeles    3500
2  Charlie   21      Chicago    3200
3    Diana   23      Houston    4000

In [134]:
#i only want to see thopse people whose age is above 21

In [137]:
df2[df2["Age"]>21]

    Name  Age         City  Salary
1    Bob   22  Los Angeles    3500
3  Diana   23      Houston    4000

In [138]:
#i only want people whose above 21 and their city must be paris

In [141]:
# df2[df2["Age"]>21 & df2["City"]=='New York'abs
df2[(df2["Age"] > 21) & (df2["City"] == 'Los Angeles')]

  Name  Age         City  Salary
1  Bob   22  Los Angeles    3500

In [142]:
#Missing Data

In [145]:
data = {
    'A': [1, 2, np.nan, 4, 5],
    'B': [2, 3, 5, 1, 4],
    'C': [4, 1, np.nan, 2, 5],
    'D': [5, 4, 5, np.nan, 1]
}

In [147]:
data

{'A': [1, 2, nan, 4, 5],
 'B': [2, 3, 5, 1, 4],
 'C': [4, 1, nan, 2, 5],
 'D': [5, 4, 5, nan, 1]}

In [149]:
df=pd.DataFrame(data)

In [151]:
df

     A  B    C    D
0  1.0  2  4.0  5.0
1  2.0  3  1.0  4.0
2  NaN  5  NaN  5.0
3  4.0  1  2.0  NaN
4  5.0  4  5.0  1.0

In [153]:
df.isna().sum()  #count using

A    1
B    0
C    1
D    1
dtype: int64

In [155]:
df.isna().any()

A     True
B    False
C     True
D     True
dtype: bool

In [157]:
#Removing null Values

In [159]:
df

     A  B    C    D
0  1.0  2  4.0  5.0
1  2.0  3  1.0  4.0
2  NaN  5  NaN  5.0
3  4.0  1  2.0  NaN
4  5.0  4  5.0  1.0

In [161]:
df.dropna()

     A  B    C    D
0  1.0  2  4.0  5.0
1  2.0  3  1.0  4.0
4  5.0  4  5.0  1.0

In [163]:
df

     A  B    C    D
0  1.0  2  4.0  5.0
1  2.0  3  1.0  4.0
2  NaN  5  NaN  5.0
3  4.0  1  2.0  NaN
4  5.0  4  5.0  1.0

In [165]:
df.dropna(thresh=3) # rows main non null values honi chahiyeh jitni threshold value ha

     A  B    C    D
0  1.0  2  4.0  5.0
1  2.0  3  1.0  4.0
3  4.0  1  2.0  NaN
4  5.0  4  5.0  1.0

In [167]:
#filling the missing data

In [169]:
df

     A  B    C    D
0  1.0  2  4.0  5.0
1  2.0  3  1.0  4.0
2  NaN  5  NaN  5.0
3  4.0  1  2.0  NaN
4  5.0  4  5.0  1.0

In [171]:
df.fillna(0)

     A  B    C    D
0  1.0  2  4.0  5.0
1  2.0  3  1.0  4.0
2  0.0  5  0.0  5.0
3  4.0  1  2.0  0.0
4  5.0  4  5.0  1.0

In [173]:
values={'A':0,'B':100,'C':300,'D':400}

In [175]:
df.fillna(value=values)

     A  B      C      D
0  1.0  2    4.0    5.0
1  2.0  3    1.0    4.0
2  0.0  5  300.0    5.0
3  4.0  1    2.0  400.0
4  5.0  4    5.0    1.0

In [177]:
df

     A  B    C    D
0  1.0  2  4.0  5.0
1  2.0  3  1.0  4.0
2  NaN  5  NaN  5.0
3  4.0  1  2.0  NaN
4  5.0  4  5.0  1.0

In [179]:
df.fillna(df.mean())

     A  B    C     D
0  1.0  2  4.0  5.00
1  2.0  3  1.0  4.00
2  3.0  5  3.0  5.00
3  4.0  1  2.0  3.75
4  5.0  4  5.0  1.00

In [181]:
#MERGING   JOINING    CONCATENATION

In [183]:
#merging

In [185]:
data1 = {
    'EmpID': [101, 102, 103, 104],
    'Name': ['Alice', 'Bob', 'Charlie', 'Diana'],
    'Department': ['HR', 'IT', 'Finance', 'IT']
}

data2 = {
    'EmpID': [101, 102, 103, 104],  # Note: EmpID 203 is missing; 206 is extra
    'BaseSalary': [50000, 60000, 55000, 70000],
    'Bonus': [5000, 7000, 4000, 6000]
}

# Create DataFrames
empl = pd.DataFrame(data1)
sal = pd.DataFrame(data2)

In [187]:
empl

   EmpID     Name Department
0    101    Alice         HR
1    102      Bob         IT
2    103  Charlie    Finance
3    104    Diana         IT

In [189]:
sal

   EmpID  BaseSalary  Bonus
0    101       50000   5000
1    102       60000   7000
2    103       55000   4000
3    104       70000   6000

In [191]:
pd.merge(empl,sal,on='EmpID',how='inner')

   EmpID     Name Department  BaseSalary  Bonus
0    101    Alice         HR       50000   5000
1    102      Bob         IT       60000   7000
2    103  Charlie    Finance       55000   4000
3    104    Diana         IT       70000   6000

In [192]:
pd.merge(empl,sal,on='EmpID',how='outer')

   EmpID     Name Department  BaseSalary  Bonus
0    101    Alice         HR       50000   5000
1    102      Bob         IT       60000   7000
2    103  Charlie    Finance       55000   4000
3    104    Diana         IT       70000   6000

In [193]:
pd.merge(empl,sal,on='EmpID',how='left')

   EmpID     Name Department  BaseSalary  Bonus
0    101    Alice         HR       50000   5000
1    102      Bob         IT       60000   7000
2    103  Charlie    Finance       55000   4000
3    104    Diana         IT       70000   6000

In [195]:
pd.merge(empl,sal,on='EmpID',how='right')

   EmpID     Name Department  BaseSalary  Bonus
0    101    Alice         HR       50000   5000
1    102      Bob         IT       60000   7000
2    103  Charlie    Finance       55000   4000
3    104    Diana         IT       70000   6000

In [199]:
#Concatenation pof 2 DATA FRAMES

In [201]:
df5=pd.DataFrame({
    'A':['A0','A1','A2'],
    'B':['B0','B1','B2'],
    'C':['C0','C1','C2']
})

df6=pd.DataFrame({
    'A':['A3','A4','A5'],
    'B':['B3','B4','B5'],
    'C':['C3','C4','C5']
})

In [203]:
df5

    A   B   C
0  A0  B0  C0
1  A1  B1  C1
2  A2  B2  C2

In [205]:
df6

    A   B   C
0  A3  B3  C3
1  A4  B4  C4
2  A5  B5  C5

In [207]:
pd.concat([df5,df6])

    A   B   C
0  A0  B0  C0
1  A1  B1  C1
2  A2  B2  C2
0  A3  B3  C3
1  A4  B4  C4
2  A5  B5  C5

In [209]:
pd.concat([df5,df6],axis=1)

    A   B   C   A   B   C
0  A0  B0  C0  A3  B3  C3
1  A1  B1  C1  A4  B4  C4
2  A2  B2  C2  A5  B5  C5

In [211]:
#Joining 2 Data frames

In [213]:
df7=pd.DataFrame({
    'name':["Alice",'Bob','Charlie']

},index=[1,2,3])
df8=pd.DataFrame({
    'score':[85,90,75]
},index=[2,3,4])

In [215]:
df7

      name
1    Alice
2      Bob
3  Charlie

In [217]:
df8

   score
2     85
3     90
4     75

In [219]:
df7.join(df8,how='outer')

      name  score
1    Alice    NaN
2      Bob   85.0
3  Charlie   90.0
4      NaN   75.0

In [221]:
df8.join(df7,how='outer')

   score     name
1    NaN    Alice
2   85.0      Bob
3   90.0  Charlie
4   75.0      NaN

In [223]:
#Group by Aggregate

In [225]:
data = {
    'Category': ['A', 'B', 'A', 'B', 'A', 'B', 'A', 'B'],
    'Store': ['S1', 'S1', 'S2', 'S2', 'S1', 'S1', 'S2', 'S2'],
    'Sales': [100, 200, 150, 300, 120, 180, 130, 250],
    'Quality': [10, 15, 12, 8, 20, 15, 15, 25],
    'Date': pd.date_range('2023-01-01', periods=8)
}

df9=pd.DataFrame(data)

In [227]:
df9

  Category Store  Sales  Quality       Date
0        A    S1    100       10 2023-01-01
1        B    S1    200       15 2023-01-02
2        A    S2    150       12 2023-01-03
3        B    S2    300        8 2023-01-04
4        A    S1    120       20 2023-01-05
5        B    S1    180       15 2023-01-06
6        A    S2    130       15 2023-01-07
7        B    S2    250       25 2023-01-08

In [229]:
#group by category and calculate the sum of sales
df9.groupby('Category')['Sales'].sum()

Category
A    500
B    930
Name: Sales, dtype: int64

In [231]:
#Group by stores and calculate the sum of sales
df9.groupby('Store')['Sales'].sum()

Store
S1    600
S2    830
Name: Sales, dtype: int64

In [233]:
#Group by multiple ccolumns
#Group by category and store

In [235]:
df9.groupby(['Category','Store'])['Sales'].sum()

Category  Store
A         S1       220
          S2       280
B         S1       380
          S2       550
Name: Sales, dtype: int64

In [237]:
#Aggregations= multiple chijo ko sath main combine karke answer nikalte hai
df9

  Category Store  Sales  Quality       Date
0        A    S1    100       10 2023-01-01
1        B    S1    200       15 2023-01-02
2        A    S2    150       12 2023-01-03
3        B    S2    300        8 2023-01-04
4        A    S1    120       20 2023-01-05
5        B    S1    180       15 2023-01-06
6        A    S2    130       15 2023-01-07
7        B    S2    250       25 2023-01-08

In [239]:
df9['Sales'].mean()

178.75

In [241]:
#median  mode min max count std
df9['Sales'].agg(['mean', 'median', 'min', 'max','count','std'])

mean      178.750000
median    165.000000
min       100.000000
max       300.000000
count       8.000000
std        68.751623
Name: Sales, dtype: float64

In [243]:
#pivot table

In [245]:
data = {
    'Date': pd.date_range('2023-01-01', periods=20),  # 20 dates starting from January 1st, 2023
    'Product': ['A', 'B', 'C', 'D'] * 5,  # Repeat 'A', 'B', 'C', 'D' 5 times
    'Region': ['East', 'South', 'North', 'West'] * 5,  # Repeat 'East', 'South', 'North', 'West' 5 times
    'Sales': np.random.randint(100, 1000, 20),  # Random sales between 100 and 1000 for 20 entries
    'Units': np.random.randint(10, 100, 20),  # Random units sold between 10 and 100 for 20 entries
    'Rep': ['Alice', 'Bob', 'Mary', 'John', 'Alice', 'Bob', 'Mary', 'John', 'Alice', 'Bob', 
            'Mary', 'John', 'Alice', 'Bob', 'Mary', 'John', 'Alice', 'Bob', 'Mary', 'John']  # Cycling through names
}
df10=pd.DataFrame(data)

In [247]:
df10

         Date Product Region  Sales  Units    Rep
0  2023-01-01       A   East    815     65  Alice
1  2023-01-02       B  South    868     57    Bob
2  2023-01-03       C  North    722     47   Mary
3  2023-01-04       D   West    342     21   John
4  2023-01-05       A   East    674     57  Alice
5  2023-01-06       B  South    441     93    Bob
6  2023-01-07       C  North    567     30   Mary
7  2023-01-08       D   West    368     57   John
8  2023-01-09       A   East    507     67  Alice
9  2023-01-10       B  South    766     27    Bob
10 2023-01-11       C  North    935     85   Mary
11 2023-01-12       D   West    754     65   John
12 2023-01-13       A   East    551     65  Alice
13 2023-01-14       B  South    988     95    Bob
14 2023-01-15       C  North    862     61   Mary
15 2023-01-16       D   West    430     52   John
16 2023-01-17       A   East    187     53  Alice
17 2023-01-18       B  South    442     48    Bob
18 2023-01-19       C  North    168     29   Mary
19 2023-01-20       D   West    906     30   John

In [253]:
pd.pivot_table(df10,values='Sales',index='Region',columns='Product',aggfunc='median')

Product      A      B      C      D
Region
East     551.0    NaN    NaN    NaN
North      NaN    NaN  722.0    NaN
South      NaN  766.0    NaN    NaN
West       NaN    NaN    NaN  430.0

In [255]:
pd.pivot_table(df10,values=['Sales','Units'],index='Region',columns='Product',aggfunc='median')

         Sales                      Units
Product      A      B      C      D     A     B     C     D
Region
East     551.0    NaN    NaN    NaN  65.0   NaN   NaN   NaN
North      NaN    NaN  722.0    NaN   NaN   NaN  47.0   NaN
South      NaN  766.0    NaN    NaN   NaN  57.0   NaN   NaN
West       NaN    NaN    NaN  430.0   NaN   NaN   NaN  52.0

In [ ]:
#Cross tab

In [257]:
pd.crosstab(df10['Region'],df10['Product'])

Product  A  B  C  D
Region
East     5  0  0  0
North    0  0  5  0
South    0  5  0  0
West     0  0  0  5

In [ ]:
#Operation

In [287]:
df11=pd.DataFrame({
    'A':[1,2,3,4,5],
    'B':[10,20,30,40,50],
    'C':[100,200,300,400,500]
})

In [289]:
df11

   A   B    C
0  1  10  100
1  2  20  200
2  3  30  300
3  4  40  400
4  5  50  500

In [290]:
df11.shape

(5, 3)

In [292]:
df11.columns

Index(['A', 'B', 'C'], dtype='object')

In [293]:
df11.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       5 non-null      int64
 1   B       5 non-null      int64
 2   C       5 non-null      int64
dtypes: int64(3)
memory usage: 252.0 bytes

In [294]:
df11.describe()

              A          B           C
count  5.000000   5.000000    5.000000
mean   3.000000  30.000000  300.000000
std    1.581139  15.811388  158.113883
min    1.000000  10.000000  100.000000
25%    2.000000  20.000000  200.000000
50%    3.000000  30.000000  300.000000
75%    4.000000  40.000000  400.000000
max    5.000000  50.000000  500.000000

In [296]:
df11['A']+10

0    11
1    12
2    13
3    14
4    15
Name: A, dtype: int64

In [297]:
def square(x):
    return x**2

In [298]:
df11['D']=df11['B'].apply(square)

In [299]:
df11

   A   B    C     D
0  1  10  100   100
1  2  20  200   400
2  3  30  300   900
3  4  40  400  1600
4  5  50  500  2500